ml.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-12-05 Sun 16:54 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Machine Learning</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Machine Learning</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge3aa85b">Introducation</a></li>
<li><a href="#orgc547d08">Application</a>
<ul>
<li><a href="#org88953fc">Image processing</a></li>
<li><a href="#orgc6f9f45">Text analysis</a></li>
<li><a href="#org1b6b8ae">Data mining</a></li>
<li><a href="#org97db97a">Video games &amp; robotics</a></li>
</ul>
</li>
<li><a href="#org2f9afb4">Algorithms</a>
<ul>
<li><a href="#orgab9095b">Categories</a>
<ul>
<li><a href="#org08ef89d">Supervised learning</a></li>
<li><a href="#orgf71ad7d">Unsupervised learning</a></li>
</ul>
</li>
<li><a href="#org48fb90f">Algorithms</a>
<ul>
<li><a href="#orgca9114b">Support vector machines (SVM's)</a></li>
<li><a href="#org324cfdd">Probabilistic models</a></li>
<li><a href="#org37517b6">Deep learning</a></li>
</ul>
</li>
<li><a href="#orgf1461af">Feature engineering</a>
<ul>
<li><a href="#orga9ea0fb">Feature extraction</a></li>
<li><a href="#orgff56934">Feature selection</a></li>
</ul>
</li>
<li><a href="#orgf6ca169">Performance metric</a></li>
</ul>
</li>
<li><a href="#orgc76cca0">Deep learning</a>
<ul>
<li><a href="#org5ce0809">Recurrent neural network (RNN)</a></li>
<li><a href="#orgfb7255f">Convolutional neural network (CNN)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge3aa85b" class="outline-2">
<h2 id="orge3aa85b">Introducation</h2>
<div class="outline-text-2" id="text-orge3aa85b">
<p>
Machine learning (ML) is a subfield of artificial intelligence (AI).
</p>
</div>
</div>
<div id="outline-container-orgc547d08" class="outline-2">
<h2 id="orgc547d08">Application</h2>
<div class="outline-text-2" id="text-orgc547d08">
</div>
<div id="outline-container-org88953fc" class="outline-3">
<h3 id="org88953fc">Image processing</h3>
<div class="outline-text-3" id="text-org88953fc">
<ul class="org-ul">
<li>Image tagging</li>
<li>Optical character recognition (OCR)</li>
<li>Self-driving cars</li>
</ul>
</div>
</div>
<div id="outline-container-orgc6f9f45" class="outline-3">
<h3 id="orgc6f9f45">Text analysis</h3>
<div class="outline-text-3" id="text-orgc6f9f45">
<ul class="org-ul">
<li>Spam filtering</li>
<li>Sentiment analysis</li>
<li>Information extract</li>
</ul>
</div>
</div>
<div id="outline-container-org1b6b8ae" class="outline-3">
<h3 id="org1b6b8ae">Data mining</h3>
<div class="outline-text-3" id="text-org1b6b8ae">
<p>
Discover patterns and make predictions from data.
</p>
<ul class="org-ul">
<li>Anomaly detection</li>
<li>Association rules</li>
<li>Grouping</li>
<li>Predictions</li>
</ul>
</div>
</div>
<div id="outline-container-org97db97a" class="outline-3">
<h3 id="org97db97a">Video games &amp; robotics</h3>
</div>
</div>
<div id="outline-container-org2f9afb4" class="outline-2">
<h2 id="org2f9afb4">Algorithms</h2>
<div class="outline-text-2" id="text-org2f9afb4">
<ul class="org-ul">
<li>ML algorithms try to solve the same problem: learn to transform every input to the correct output.</li>
<li>ML algorithms try to make generalizations, and create the simplest hypothesis (with fewest assumptions) that explains most of the training examples.</li>
</ul>
</div>
<div id="outline-container-orgab9095b" class="outline-3">
<h3 id="orgab9095b">Categories</h3>
<div class="outline-text-3" id="text-orgab9095b">
</div>
<div id="outline-container-org08ef89d" class="outline-4">
<h4 id="org08ef89d">Supervised learning</h4>
<div class="outline-text-4" id="text-org08ef89d">
<p>
For each training example, the correct output must be provided.
</p>
</div>
</div>
<div id="outline-container-orgf71ad7d" class="outline-4">
<h4 id="orgf71ad7d">Unsupervised learning</h4>
<div class="outline-text-4" id="text-orgf71ad7d">
<p>
The training examples but not the desired output are the input.
</p>
</div>
</div>
</div>
<div id="outline-container-org48fb90f" class="outline-3">
<h3 id="org48fb90f">Algorithms</h3>
<div class="outline-text-3" id="text-org48fb90f">
</div>
<div id="outline-container-orgca9114b" class="outline-4">
<h4 id="orgca9114b">Support vector machines (SVM's)</h4>
<div class="outline-text-4" id="text-orgca9114b">
<p>
The model tries to build a set of hyperplanes in a high dimensional space which tries to separate instances of different classes by getting the largest separation between the nearest instances from different classes.
</p>
</div>
</div>
<div id="outline-container-org324cfdd" class="outline-4">
<h4 id="org324cfdd">Probabilistic models</h4>
<div class="outline-text-4" id="text-org324cfdd">
<ul class="org-ul">
<li>The models try to predict the correct response by modeling the problem with a probability distribution, e.g., Naive Bayes classifiers.</li>
<li>It returns the prediction as well as the corresponding degree of certainty.</li>
</ul>
</div>
</div>
<div id="outline-container-org37517b6" class="outline-4">
<h4 id="org37517b6">Deep learning</h4>
<div class="outline-text-4" id="text-org37517b6">
<ul class="org-ul">
<li>It is based on the artificial neural network models. They try to emulate (in a very simplified way) the way the brain works.</li>
<li>The network consist of a huge set of interconnected neurons, i.e., the basic processing unit, organized in various layers.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf1461af" class="outline-3">
<h3 id="orgf1461af">Feature engineering</h3>
<div class="outline-text-3" id="text-orgf1461af">
</div>
<div id="outline-container-orga9ea0fb" class="outline-4">
<h4 id="orga9ea0fb">Feature extraction</h4>
<div class="outline-text-4" id="text-orga9ea0fb">
<p>
Before fed to the ML algorithms, the raw data should be tranformed into a vector of features.
</p>
</div>
</div>
<div id="outline-container-orgff56934" class="outline-4">
<h4 id="orgff56934">Feature selection</h4>
<div class="outline-text-4" id="text-orgff56934">
<ul class="org-ul">
<li>Score each feature and return only the most valuable ones.</li>
<li>Do not use huge feature sets.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf6ca169" class="outline-3">
<h3 id="orgf6ca169">Performance metric</h3>
<div class="outline-text-3" id="text-orgf6ca169">
<ul class="org-ul">
<li>The instances for training and testing must be disjoint.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc76cca0" class="outline-2">
<h2 id="orgc76cca0">Deep learning</h2>
<div class="outline-text-2" id="text-orgc76cca0">
<p>
A subfield of machine learning.
</p>
</div>
<div id="outline-container-org5ce0809" class="outline-3">
<h3 id="org5ce0809">Recurrent neural network (RNN)</h3>
</div>
<div id="outline-container-orgfb7255f" class="outline-3">
<h3 id="orgfb7255f">Convolutional neural network (CNN)</h3>
<div class="outline-text-3" id="text-orgfb7255f">
<ul class="org-ul">
<li>Take a 2-D array as input.</li>
<li>Direct operation on the image rather than feature extraction</li>
<li>Basic ideas
<ul class="org-ul">
<li>Local receptive field</li>
<li>Convolution</li>
<li>Pooling</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
